# InvalidGeometryId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BRepBuilderGeometryId..::..InvalidGeometryId Method
BRepBuilderGeometryId Class See Also
---
Returns an invalid BRepBuilderGeometryId, used as a return value to indicate an error.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public static BRepBuilderGeometryId InvalidGeometryId()
```

Visual Basic
---
```text
Public Shared Function InvalidGeometryId As BRepBuilderGeometryId
```

Visual C++
---
```text
public:
static BRepBuilderGeometryId^ InvalidGeometryId()
```

# See Also
BRepBuilderGeometryId Class
Autodesk.Revit.DB Namespace